<template>
  	<div class="wrapper-content">
		  <div class="ibox">
			  <div class="ibox-content">
		<p>	<b>“欢迎来到智慧水利系统”</b>

		<h2>功能模块</h2>

<p>1.数据建模</p>
          <b>包括了数据源、数据表、数据集合三个子模块</b>
          <br/>
          <b>1.1、数据源：支持动态配置连接多种数据源，如关系型数据库mysql、oracle等，配置连接了数据源就可以操作对应数据表的数据</b>
          <br/>
          <b>1.2、数据表：选择对应的数据源就可以选择不同数据源底下具体的数据表，大多数情况下，一个表是一个大类型的数据集中地，例如“2012年桂林降雨量与气温情况表”</b>
          <br/>
          <b>1.2、数据集：选择对应的数据表可对具体的表字段进行裁剪、组装，定义哪些字段是维度哪些是度量，例如以月字段作为维度，以降雨量为度量，统计该表每个月的降雨量形成图表。数据集为最终定制化图表提供了数据来源</b>
          <br/>
<p>2.数据报表</p>
          <b>包括了新建报表、报表管理两个子模块</b>
          <br/>
          <b>2.1、新建报表：采用了可视化图标库echarts提供的例如图表、表格等丰富的图形资源，对数建模好的水利相关数据进行定制化拖拽呈现，最终保存成一个个报表</b>
          <br/>
          <b>2.2、报表管理：可对新建好的报表进行增删改查、分享、导出等操作</b>
          <br/>
<p>3.权限管理</p>
          <b>包括了用户管理、角色管理、菜单管理三个个子模块</b>
          <br/>
          <b>3.1、用户管理：可以注册用户并授权该用户角色和菜单</b>
          <br/>
          <b>3.2、角色管理：可新增具体角色，为具体角色授权可查看的菜单，例如访客角色只授权数据报表菜单</b>
          <br/>
          <b>3.3、菜单管理：支持动态管理菜单</b>
          <br/>
<br/>
			  </div>
		  </div>
  	</div>
</template>

<script>
	import {baseUrl} from '@/common/biConfig'
	import $ from 'jquery'

	export default {
	    data(){
			return {

			}
		},
		mounted(){

		},
		computed: {
		},
		methods: {
		},
		watch: {
		}
	}
</script>

<style lang="less" scoped>
	@import '../style/mixin';
</style>
